{
  "payment": {
    "method_title": "How would you like to pay?",
    "img": "QR Code Payment",
    "method_option1": "QR Code Payment",
    "method_option2": "E-wallet &  Mobile Banking",
    "method_option3": "Credit/Debit Card",
    "method_option4": "ATM/Bank Account",
    "method_option5": "Pay at hotel",
    "note_1": "Make sure you have any e-wallet or mobile banking app that supports payment with QR code.",
    "note_2": "A QR code will appear after you click 'Pay' button. Simply save or screenshot the QR code to complete your payment within the time limit.",
    "note_3": "Please use the latest QR code provided to complete your payment.",
    "note_4": "The card Issuer supports online payment and the credit limit/ account balance enough to cover the payment.",
    "note_5": "A list of bank providers will appear after you click the pay button. Choose your card providers and enter the details required. Then complete your payment by following the verification steps.",
    "note_6": "Present your hotel reservation form for the receptionist to confirm the information and cost.",
    "note_7": "Payment at the hotel will be made in cash or credit/debit card.",
    "promotion_title": "Have a promo code?",
    "input_text": "Enter promo code here",
    "promotion_apply_button": "Apply",
    "detail_title": "Price details",
    "room_info": "(x1) Deluxe Park View Room - 2 Guests",
    "room_price": "2,200,000 VND",
    "total_price_title": "Total price",
    "total_price": "2,200,000 VND",
    "submit": "Continue with ",
    "note_text": "By continuing to payment, you have agreed to AHomeVilla and Terms & Conditions Privacy Policy",
    "guests": "Guests",
    "success": "Booking created successfully! Please scan the QR code to pay.",
    "success2": "Booking created successfully! Check the status of your booking via email or your booking list.",
    "error": "An error occurred while creating the booking. Returning to the homepage...",
    "back": "Back"
  },

  "confirm": {
    "title": "Scan QR Code below to pay",
    "expire": "Payment QR Code will be expired",
    "note": "Please do not change bank transfer description",
    "save": "Save image",
    "back": "Back"
  },

  "inquiry": {
    "title": "How to Pay with QR",
    "text1": "1. Open your e-wallet or mobile banking application that supports QR payment with QuickPay, then scan the QR code above.",
    "text2": "2. Make sure the total amount and payment destination match the details above, then complete your payment within the time limit.",
    "text3": "3. Your booking will be automatically confirmed after a successful payment. You can check your booking status on the Bookings page."
  },

  "booking": {
    "bank": "Bank",
    "holder": "Account Holder :",
    "number": "Account Number :",
    "copy": "Copy"
  }, 

  "inform": {
    "title": "Your booking has been placed!",
    "subtitle1": "Thanks for your reservation!",
    "subtitle2": "We're dedicated to providing you with the best experience possible.",
    "button": "OK"
  }
}
