{
  "about": {
    "subtitle": "TUYỂN CHỌN NHỮNG CHUYẾN ĐI SANG TRỌNG VÀ ĐỘC QUYỀN ĐƯỢC THIẾT KẾ RIÊNG",
    "title": "CÂU CHUYỆN CỦA AHOMEVILLA",
    "para": "A HomeVilla Stories cung cấp một loạt các trải nghiệm du lịch, mỗi câu chuyện được kết hợp một cách tinh tế với sự độc đáo và thanh lịch riêng là dấu ấn về sự lựa chọn đặc biệt của chúng tôi về các bất động sản xuất sắc. Bằng cách chia sẻ những cuộc phiêu lưu này, chúng tôi muốn đưa bạn đến từng điểm đến, nhấn mạnh sự sung túc yên bình của những gì mà chỗ ở sang trọng của chúng tôi có thể mang lại.",
    "subtitle2": "HÉ LỘ NHỮNG BÍ MẬT ĐƯỢC GIỮ KÍN NHẤT CỦA A HOMEVILLA",
    "title2": "NHỮNG KỲ NGHỈ ĐẶC SẮC & NHỮNG VIÊN NGỌC ĐƯỢC ẨN GIẤU",
    "para2": "Bước vào một thế giới nơi sự sang trọng và độc đáo kết hợp để tạo ra một trải nghiệm du lịch thực sự đặc biệt và cá nhân hóa. Bộ sưu tập các kỳ nghỉ tại A HomeVilla của chúng tôi sẽ giới thiệu đến bạn những điểm đến sang trọng và những nơi ẩn dật, nơi mà sự xa hoa không có giới hạn. Trải nghiệm niềm vui khi khám phá những viên ngọc ẩn giấu và các kỳ nghỉ thượng hạng, được lựa chọn tỉ mỉ nhờ vào vẻ đẹp độc đáo, sự thoải mái vô song và lời hứa về một hành trình đáng nhớ."
  },
  "contact": {
    "title": "Điều Gì Tạo Nên Sự Độc Đáo Của A HomeVilla: Những Điều Bạn Chỉ Có Thể Tìm Thấy Tại Khách Sạn Của Chúng Tôi",
    "para1": "Thành lập vào năm 1926 với vị trí đắc địa bậc nhất thủ đô Hà Nội, gần các trung tâm văn hóa, thương mại, tài chính, A HomeVilla là một trong những công trình kiến trúc độc đáo ghi dấu ấn của người Pháp. Trải qua 100 năm hình thành và phát triển, A HomeVilla đã vinh dự được đón nhiều đoàn ngoại giao, các lãnh đạo cấp cao cùng những doanh nhân trong nước và quốc tế.",
    "para2": "A HomeVilla  có khởi đầu là một quán bia mang tên Le Coq d’Or (Brasserie Le Coq d’Or) tọa lạc tại góc đại lộ Carreau và Henri-Rivière (phố Lý Thường Kiệt và phố Ngô Quyên ngày nay). Vào khoảng đầu thế kỷ XX (năm 1917 – 1918), người Pháp đã quyết định xây dựng tại đây một khách sạn 2 tầng, mang đặc trưng kiến trúc của Pháp với tên gọi Le Coq d’Or (Gà Trống vàng) với 56 phòng, trong đó có 12 phòng hạng sang.",
    "para3": "Ngày 19/5/1931, sau quá trình chuyển nhượng người sở hữu, Khách sạn Le Coq d’Or đã được cải tạo, nâng cấp. Sảnh khách sạn được mở rộng, số tầng cũng được nâng lên thành 3 tầng, với tổng số 80 phòng. Lúc này, khách sạn được đổi tên thành Splendid (Chốn Bồng Lai), chính thức khai trương ngày 1/1/1932.",
    "para4": "Năm 2016, với dự án cải tạo toàn diện của đơn vị tư vấn và quản lý khách sạn chuyên nghiệp STS, Khách sạn Hòa Bình đã có một diện mạo hoàn toàn mới. Điều đáng ghi nhận và cũng là điều mà mỗi du khách cũng như người dân mong chờ, đó là những dấu ấn kiến trúc từ thời Pháp của khách sạn vẫn được bảo tồn nguyên vẹn.",
    "viewmap": "Xem bản đồ",
    "contact": "Liên hệ với chúng tôi",
    "byphone": "Qua điện thoại",
    "phonedesc": "Nhận hỗ trợ qua điện thoại bằng cách đăng nhập vào tài khoản của bạn.",
    "chat": "Trò chuyện trực tiếp",
    "chatdesc": "Trò chuyện với một nhân viên chăm sóc khách hàng của chúng tôi."
  },
  "village": {
    "newDN": "CHI NHÁNH MỚI: {{name}}",
    "nameDN": "A HOMEVILLA Hotel Đà Nẵng Centre",
    "desDN": "Vừa ra mắt, A HOMEVILLA là trải nghiệm Đà Nẵng đúng bài với vị trí trung tâm và phòng ngập nắng. Tặng voucher trị giá 1.5 triệu tại những điểm đến bản địa nhất.",
    "booking": "Đặt ngay",
    "newHCM": "CHI NHÁNH MỚI: HỒ CHÍ MINH",
    "desHCM1": "Điểm đến lý tưng để “phá đảo” văn hoá Sài Gòn Chợ Lớn! Nằm tại giao lộ Quận 1 và 5, mang âm hưởng thiết kế Trung Hoa, có dịch vụ tiện ích linh hoạt.",
    "desHCM2": "Chọn Express Nguyễn Bỉnh Khiêm cho chuyến công tác tiện lợi nhưng yên tĩnh tại Quận 1. 100% lựa chọn có phòng ngủ và phòng khách riêng biệt kèm bếp riêng tại phòng."
  },
  "content": {
    "header": "Bộ sưu tập những câu chuyện tại A HOMEVILLA",
    "title": "Khám phá các Villa mới"
  }
}
