'use client';
import { useTranslation } from '@/i18n/client';
import Image from 'next/image';
import { useState } from 'react';
import SideBarInformation from './SideBarInformation';
import SideBarPolicy from './SideBarPolicy';
interface SideBar2 {
  lng: string;
}

const SideBar2 = ({ lng }: Readonly<SideBar2>) => {
  const { t } = useTranslation(lng, 'account');
  const side_bar_pay_ment = true;
  return (
    <div className=''>
      <div className='flex flex-col'>
        {!side_bar_pay_ment && (
          <div className='text-white text-xs bg-orange-600 font-semibold rounded-xl  rounded-b-none px-2 py-2'>
            Đơn đặt phòng này sẽ được tính vào MORE của bạn
          </div>
        )}
        {side_bar_pay_ment && (
          <div className='flex items-center flex-1 py-3 gap-2 bg-orange-200 rounded-xl  rounded-b-none px-2'>
            <div className='flex items-center'>
              <svg
                width='23'
                height='18'
                viewBox='0 0 23 18'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'
              >
                <path
                  d='M22.25 16.0723H20.5625V5.53711H20.75C20.8992 5.53711 21.0423 5.4797 21.1477 5.37751C21.2532 5.27531 21.3125 5.13671 21.3125 4.99219C21.3125 4.84767 21.2532 4.70906 21.1477 4.60687C21.0423 4.50468 20.8992 4.44727 20.75 4.44727H16.0625V1.17773H16.25C16.3992 1.17773 16.5423 1.12032 16.6477 1.01813C16.7532 0.915938 16.8125 0.777335 16.8125 0.632812C16.8125 0.48829 16.7532 0.349687 16.6477 0.247494C16.5423 0.145302 16.3992 0.0878906 16.25 0.0878906H2.75C2.60082 0.0878906 2.45774 0.145302 2.35225 0.247494C2.24676 0.349687 2.1875 0.48829 2.1875 0.632812C2.1875 0.777335 2.24676 0.915938 2.35225 1.01813C2.45774 1.12032 2.60082 1.17773 2.75 1.17773H2.9375V16.0723H1.25C1.10082 16.0723 0.957742 16.1297 0.852252 16.2319C0.746763 16.3341 0.6875 16.4727 0.6875 16.6172C0.6875 16.7617 0.746763 16.9003 0.852252 17.0025C0.957742 17.1047 1.10082 17.1621 1.25 17.1621H22.25C22.3992 17.1621 22.5423 17.1047 22.6477 17.0025C22.7532 16.9003 22.8125 16.7617 22.8125 16.6172C22.8125 16.4727 22.7532 16.3341 22.6477 16.2319C22.5423 16.1297 22.3992 16.0723 22.25 16.0723ZM19.4375 5.53711V16.0723H16.0625V5.53711H19.4375ZM4.0625 1.17773H14.9375V16.0723H12.3125V11.5312C12.3125 11.3867 12.2532 11.2481 12.1477 11.1459C12.0423 11.0437 11.8992 10.9863 11.75 10.9863H7.25C7.10082 10.9863 6.95774 11.0437 6.85225 11.1459C6.74676 11.2481 6.6875 11.3867 6.6875 11.5312V16.0723H4.0625V1.17773ZM11.1875 16.0723H7.8125V12.0762H11.1875V16.0723ZM5.9375 4.26562C5.9375 4.1211 5.99676 3.9825 6.10225 3.88031C6.20774 3.77811 6.35082 3.7207 6.5 3.7207H8C8.14918 3.7207 8.29226 3.77811 8.39775 3.88031C8.50324 3.9825 8.5625 4.1211 8.5625 4.26562C8.5625 4.41015 8.50324 4.54875 8.39775 4.65094C8.29226 4.75314 8.14918 4.81055 8 4.81055H6.5C6.35082 4.81055 6.20774 4.75314 6.10225 4.65094C5.99676 4.54875 5.9375 4.41015 5.9375 4.26562ZM10.4375 4.26562C10.4375 4.1211 10.4968 3.9825 10.6023 3.88031C10.7077 3.77811 10.8508 3.7207 11 3.7207H12.5C12.6492 3.7207 12.7923 3.77811 12.8977 3.88031C13.0032 3.9825 13.0625 4.1211 13.0625 4.26562C13.0625 4.41015 13.0032 4.54875 12.8977 4.65094C12.7923 4.75314 12.6492 4.81055 12.5 4.81055H11C10.8508 4.81055 10.7077 4.75314 10.6023 4.65094C10.4968 4.54875 10.4375 4.41015 10.4375 4.26562ZM6.5 8.44336C6.35082 8.44336 6.20774 8.38595 6.10225 8.28376C5.99676 8.18156 5.9375 8.04296 5.9375 7.89844C5.9375 7.75392 5.99676 7.61531 6.10225 7.51312C6.20774 7.41093 6.35082 7.35352 6.5 7.35352H8C8.14918 7.35352 8.29226 7.41093 8.39775 7.51312C8.50324 7.61531 8.5625 7.75392 8.5625 7.89844C8.5625 8.04296 8.50324 8.18156 8.39775 8.28376C8.29226 8.38595 8.14918 8.44336 8 8.44336H6.5ZM10.4375 7.89844C10.4375 7.75392 10.4968 7.61531 10.6023 7.51312C10.7077 7.41093 10.8508 7.35352 11 7.35352H12.5C12.6492 7.35352 12.7923 7.41093 12.8977 7.51312C13.0032 7.61531 13.0625 7.75392 13.0625 7.89844C13.0625 8.04296 13.0032 8.18156 12.8977 8.28376C12.7923 8.38595 12.6492 8.44336 12.5 8.44336H11C10.8508 8.44336 10.7077 8.38595 10.6023 8.28376C10.4968 8.18156 10.4375 8.04296 10.4375 7.89844Z'
                  fill='#EF4307'
                ></path>
              </svg>
            </div>
            <div className='flex flex-col'>
              <div className='font-medium text-lg hidden sm:block'>Chi tiết đặt phòng</div>
              <div className='font-medium text-lg sm:hidden'>M VILLAGE HOTEL HỒ GƯƠM</div>
              <div className='text-sm text-gray-500 sm:hidden'>
                Số 38, phố Hai Bà Trưng, P. Tràng Tiền, Q. Hoàn Kiếm, Hà Nội
              </div>
            </div>
          </div>
        )}

        <div className='rounded-t-none bg-white rounded-xl px-4 py-6'>
          <SideBarInformation lng={lng} side_bar_pay_ment={side_bar_pay_ment} />

          {side_bar_pay_ment && (
            <div className={side_bar_pay_ment ? 'hidden sm:block' : ''}>
              <div className='text-base font-medium'>Thông tin check-in</div>
              <div className='flex items-center justify-between mt-2'>
                <div className='text-gray-500'>Khách</div>
                <div className='text-base font-medium'>nguyenngocdung</div>
              </div>
              <div className='mt-3'>
                <div className='flex items-center gap-2'>
                  <svg
                    width='16'
                    height='16'
                    viewBox='0 0 16 16'
                    fill='none'
                    xmlns='http://www.w3.org/2000/svg'
                  >
                    <path
                      d='M6.80167 11.2596L12.1317 5.9296L11.5417 5.3396L6.80167 10.0796L4.42667 7.7046L3.83667 8.2946L6.80167 11.2596ZM8.0025 15.5029C6.96583 15.5029 5.99083 15.3063 5.0775 14.9129C4.16472 14.519 3.37056 13.9846 2.695 13.3096C2.01944 12.6346 1.48472 11.8413 1.09083 10.9296C0.696945 10.0179 0.5 9.04321 0.5 8.00543C0.5 6.96765 0.696945 5.99265 1.09083 5.08043C1.48417 4.16765 2.01778 3.37349 2.69167 2.69793C3.36556 2.02237 4.15917 1.48765 5.0725 1.09376C5.98583 0.699874 6.96083 0.50293 7.9975 0.50293C9.03417 0.50293 10.0092 0.699874 10.9225 1.09376C11.8353 1.4871 12.6294 2.02099 13.305 2.69543C13.9806 3.36987 14.5153 4.16349 14.9092 5.07626C15.3031 5.98904 15.5 6.96376 15.5 8.00043C15.5 9.0371 15.3033 10.0121 14.91 10.9254C14.5167 11.8388 13.9822 12.6329 13.3067 13.3079C12.6311 13.9829 11.8378 14.5177 10.9267 14.9121C10.0156 15.3065 9.04083 15.5035 8.0025 15.5029Z'
                      fill='#24C35E'
                    ></path>
                  </svg>
                  <span>Hủy Phòng Miễn Phí</span>
                </div>
                <div className='flex items-center gap-2'>
                  <svg
                    width='16'
                    height='16'
                    viewBox='0 0 16 16'
                    fill='none'
                    xmlns='http://www.w3.org/2000/svg'
                  >
                    <path
                      d='M6.80167 11.2596L12.1317 5.9296L11.5417 5.3396L6.80167 10.0796L4.42667 7.7046L3.83667 8.2946L6.80167 11.2596ZM8.0025 15.5029C6.96583 15.5029 5.99083 15.3063 5.0775 14.9129C4.16472 14.519 3.37056 13.9846 2.695 13.3096C2.01944 12.6346 1.48472 11.8413 1.09083 10.9296C0.696945 10.0179 0.5 9.04321 0.5 8.00543C0.5 6.96765 0.696945 5.99265 1.09083 5.08043C1.48417 4.16765 2.01778 3.37349 2.69167 2.69793C3.36556 2.02237 4.15917 1.48765 5.0725 1.09376C5.98583 0.699874 6.96083 0.50293 7.9975 0.50293C9.03417 0.50293 10.0092 0.699874 10.9225 1.09376C11.8353 1.4871 12.6294 2.02099 13.305 2.69543C13.9806 3.36987 14.5153 4.16349 14.9092 5.07626C15.3031 5.98904 15.5 6.96376 15.5 8.00043C15.5 9.0371 15.3033 10.0121 14.91 10.9254C14.5167 11.8388 13.9822 12.6329 13.3067 13.3079C12.6311 13.9829 11.8378 14.5177 10.9267 14.9121C10.0156 15.3065 9.04083 15.5035 8.0025 15.5029Z'
                      fill='#24C35E'
                    ></path>
                  </svg>
                  <span>Có thể dời lịch</span>
                </div>
              </div>
              <div className='bg-gray-400 h-[1px] my-2 '> </div>
            </div>
          )}

          {side_bar_pay_ment && (
            <div className={side_bar_pay_ment ? 'hidden sm:block' : ''}>
              <div className='mb-2 font-medium'>Thông tin liên hệ</div>
              <div className='flex items-center justify-between'>
                <div className='text-gray-500'>Người đặt phòng</div>
                <div className='font-medium'>nguyenngocdung</div>
              </div>
              <div className='flex items-center justify-between'>
                <div className='text-gray-500'>Số điện thoại</div>
                <div className='font-medium'>+84969012735</div>
              </div>
              <div className='flex items-center justify-between'>
                <div className='text-gray-500'>Email</div>
                <div className='font-medium'>nguyenngocdung8g@gmail.com</div>
              </div>
            </div>
          )}
        </div>

        <SideBarPolicy lng={lng} side_bar_pay_ment={side_bar_pay_ment} />
      </div>
    </div>
  );
};

export default SideBar2;
